In [ ]:
from IPython.core.display import HTML
HTML("<style>.jp-RenderedMarkdown{font-family:'IRANSans,Tahoma,Helvetica,sans-serif';display:flex;flex-direction:column;margin-top:10px;font-size:1rem;direction:rtl}mark{font-size:1.1rem;color:inherit;padding:2px; background-color:#88888888}</style>")

<div>
در آغاز چون نیاز به توابع کتاب‌خانه‌ی 
    <mark>pandas</mark>
    دارید، باید آن را 
    <mark>import</mark>
    کنید.
    </div>

In [2]:
import pandas as pd

<div>
ابتدا فایل
<mark>dates.csv</mark>
که در کنار این نوت‌بوک وجود دارد را به وسیله‌ی کتابخانه
    <mark>pandas</mark>
بخوانید
    </div>

In [3]:
df = pd.read_csv('dates.csv')

<div>
می‌توانید با استفاده از متد
    <mark>describe</mark>
خلاصه‌ای از اطلاعات هر ستون را ببینید.

In [4]:
df.describe()

          Unnamed: 0         year
count    5000.000000  5000.000000
mean   222892.446400  1985.259200
std    126952.536025    27.788351
min       108.000000  1911.000000
25%    113078.500000  1966.000000
50%    222977.500000  1996.000000
75%    332407.000000  2008.000000
max    441544.000000  2020.000000

<div>
می‌توانید به وسیله‌ی متد 
<mark>head</mark>
چند ردیف اول از داده را بخوانید
    </div>

In [5]:
df.head()

   Unnamed: 0                               title  year  country        date
0      324126                Synecdoche, New York  2008      USA  2008-11-21
1       66463  Close Encounters of the Third Kind  1977   Greece  1978-03-10
2       51496                      Brotherly Love  1928  Finland  1929-11-18
3      236362                     My Son, My Son!  1940   Mexico  1940-05-23
4      374347         The North Avenue Irregulars  1979      USA  1979-02-09

<div>
در
    <mark>pandas</mark>
    وقتی  نام ستونی در فایل 
    <mark>csv</mark>
    ذکر نشده باشد، آن را به صورت 
    <mark>Unnamed: i</mark>
    نام‌گذاری می‌کند که i نشان‌دهنده‌ی iمین ستون بدون نام است.
<br>
    <br>
اگر به کمک دستور 
    <mark>head</mark>
    بخشی از داده را مشاهده کرده باشید، می‌بینید که یک ستون 
    <mark>Unnamed</mark>
    در این داده وجود دارد.
<br>
    <br>
به کمک متد
<mark>drop</mark>
 <br>
    دقت داشته باشید که دستور drop
    در صورتی که از ویژگی  <mark>inplace</mark>
   استفاده نکنید یک دیتا فریم جدید برمی‌گرداند لذا یا باید آنرا در متغیر جدید ذخیره کنید و یا   <mark>inplace=True</mark> قرار دهید

In [6]:
df.drop(columns = ['Unnamed: 0'], inplace = True)

<div>
اکنون اگر به نوع
    (type)
    ستون‌های دیتافریم نگاهی بیاندازید مشاهده می‌کنید که نوع ستون date 
    از نوع کلی object
     می‌باشد، در حالیکه واضحا می‌دانیم که این ستون از نوع datetime
    می‌باشد. یکی از قابلیت‌های کتابخانه pandas
    تبدیل ستون از نوع رشته با فرمت خاص به نوع datetime
    می‌باشد. این کار باعث راحتی فیلتر کردن تاریخ و کار با داده‌های datetime را فراهم می‌کند 
    </div>

In [7]:
print(df.dtypes)

title      object
year        int64
country    object
date       object
dtype: object

In [8]:
df["formatted_date"]= pd.to_datetime(df["date"])

print(df.dtypes)

title                     object
year                       int64
country                   object
date                      object
formatted_date    datetime64[ns]
dtype: object

In [9]:
df = df.set_index('formatted_date')

In [10]:
df.loc["2015-5":"2015-5"]

                                     title  year         country        date
formatted_date
2015-05-07                 Les combattants  2014          Greece  2015-05-07
2015-05-07                     Hot Pursuit  2015     Philippines  2015-05-07
2015-05-21                    Tomorrowland  2015          Israel  2015-05-21
2015-05-21                   Kami no tsuki  2014       Hong Kong  2015-05-21
2015-05-21                    Tomorrowland  2015         Ukraine  2015-05-21
2015-05-28          Paul Blart: Mall Cop 2  2015  Czech Republic  2015-05-28
2015-05-15               A Royal Night Out  2015         Ireland  2015-05-15
2015-05-21            She's Funny That Way  2014          Serbia  2015-05-21
2015-05-08                The Little Death  2014              UK  2015-05-08
2015-05-22                    Kamara Kattu  2015           India  2015-05-22
2015-05-22                Na Maloom Afraad  2014              UK  2015-05-22
2015-05-29                     I Love Desi  2015           India  2015-05-29
2015-05-29      What We Did on Our Holiday  2014           Spain  2015-05-29
2015-05-22                       Jamai 420  2015           India  2015-05-22
2015-05-13               Aynehaye rooberoo  2011          France  2015-05-13
2015-05-29                     Wonder Mama  2014           China  2015-05-29
2015-05-22                            1944  2015       Lithuania  2015-05-22
2015-05-29                       10.000 Km  2014          Sweden  2015-05-29
2015-05-22             Unfinished Business  2015          Turkey  2015-05-22

<div>
    یکی دیگر از متد‌های pandas
    که برای کار را برای پردازش داده‌های رشته‌ای بسیار راحت می‌کند، متد str
     می‌باشد. با استفاده از این متد می‌توانید فیلترهایی به شکل 
    <mark>regex</mark>
    را بر روی داده‌های رشته‌ای اعمال کنید.
    <br>
    به طور مثال می‌خواهیم تمام فیلم‌هایی که نام کشور آن‌ها 
    فاقد فاصله 
    (space)
    هستند و سال ساخت آنها ماه دسامبر ۲۰۰۵ 
    می‌باشد را فیلتر کنیم:
    </div>

In [11]:
m_2005 = df.loc["2005-12"]
m_2005[m_2005['country'].str.match(r"\S")]

,title,year,country,date
formatted_date,,,,
2005-12-08,Creep,2004,Hong Kong,2005-12-08
2005-12-28,Maxx,2005,Iran,2005-12-28
2005-12-23,"The Chronicles of Narnia: The Lion, the Witch ...",2005,Bulgaria,2005-12-23
2005-12-08,Bulutlari beklerken,2003,Germany,2005-12-08
2005-12-14,King Kong,2005,Georgia,2005-12-14
2005-12-15,King Kong,2005,Kazakhstan,2005-12-15
2005-12-22,Corpse Bride,2005,Portugal,2005-12-22
2005-12-02,Keeping Mum,2005,Ireland,2005-12-02
2005-12-28,Tiempo real,2002,France,2005-12-28
2005-12-22,"The Chronicles of Narnia: The Lion, the Witch ...",2005,Singapore,2005-12-22

<div>
      برای این تمرین شما بایستی پس از حذف ستون 
    <mark>Unnamed: i</mark>
    تمامی فیلم‌هایی که در بازه زمانی 
    <mark>2000-11</mark>تا
<mark>2018-11</mark>
    ساخته شده‌اند و اول نام فیلم‌ها با حرف 
    <mark>B</mark>
    شروع می‌شود را فیلتر کرده و مقادیر خروجی را با توجه به index
    را با کمک متد 
    <a href="https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sort_index.html">sort_index</a> 
    مرتب کرده 
    و در فایل 
    <mark>sample.csv</mark>
    ذخیره کنید.
    <br>
    <br>
    برای راحتی ادامه فرآیند نام متغیر نهایی را از 
    <mark> filtered_df</mark>
    تغییر ندهید 
    </div>

In [14]:
filter = df.loc["2000-11":"2018-11"]
filtered_df = filter[filter['title'].str.match(r'(^B.*)')]
filtered_df = filtered_df.sort_index()

<div>
    برای تست پاسخ خود می‌توانید از دوسلول زیر استفاده کنید. در سلول اول ستون‌های اولین ردیف از جدول خود را می‌توانید مشاهده کنید و در سلول بعدی index اولین ردیف را می‌توانید چک کنید
 و در انتها shape دیتافریم خروجی را می‌توانید بررسی کنید.    
</div>

In [15]:
assert filtered_df.iloc[0].to_dict() == {'title': 'Bless the Child','year': 2000, 'country': 'Iceland', 'date': '2001-01-12'}

In [16]:
assert filtered_df.head(1).index == '2001-01-12'

In [17]:
assert filtered_df.shape == (99, 4)

<div>
    <mark>توجه»</mark>
    متد to_csv  را بدون هیچ پارامتر دیگری به جز نام 
    <mark>sample.csv</mark>
     ، یعنی به صورت زیر صدا بزنید و 
    <mark>header</mark> , <mark>index</mark> آنرا تغییر ندهید
</div>

In [18]:
filtered_df.to_csv('sample.csv')

بعد از ذخیره کردن نوت‌بوک، **ارسال پاسخ** را انتخاب کنید.